app/views/articles/_article.html.erb

    <span class="badge badge-pill badge-light">
        <%= raw article.categories.map(&:category).map {
---
SELECT "categories".* FROM "categories" INNER JOIN "filters" ON "categories"."id" = "filters"."category_id" WHERE "filters"."article_id" = ?  [["article_id", 8]]