app/views/articles/index.html.erb

      <!-- DO REFACTOR -->
      <%	 article.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "filters" ON "categories"."id" = "filters"."category_id" WHERE "filters"."article_id" = ?  [["article_id", 8]]