app/views/users/show.html.erb

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]
---
<%	 if current_user.articles.count.zero? %>

SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]
---

<%  current_user.articles.each do |article| %>