app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id", "user_name") VALUES (?, ?, ?, ?, ?, ?)  [["title", "berserker"], ["text", "berserker berserker"], ["created_at", "2018-07-16 07:18:31.952648"], ["updated_at", "2018-07-16 07:18:31.952648"], ["user_id", 1], ["user_name", "fon_luchs"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save