app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."category" = ? LIMIT ?  [["category", "welcome"], ["LIMIT", 1]]
---
  def show
    @category = Category.find_by(category: params[:id])