app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."category" = ? LIMIT ?  [["category", "welcome"], ["LIMIT", 1]]
---
  def index
    @categories = Category.all

INSERT INTO "categories" ("category") VALUES (?)  [["category", "ssssssssssssss"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "welcome"], ["LIMIT", 1]]
---
  def show
    @category = Category.find_by(name: params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."category" = ? LIMIT ?  [["category", "welcome"], ["LIMIT", 1]]
---
  def destroy
    @category = Category.find(params[:id])