app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "fon_luchs"], ["body", "tst"], ["article_id", 8], ["created_at", "2018-08-07 12:02:27.322615"], ["updated_at", "2018-08-07 12:02:27.322615"], ["user_id", 1]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT ?  [["article_id", 7], ["id", 2], ["LIMIT", 1]]
---
  def destroy
    @article = Article.find(params[:article_id])
    @article.comments.find(params[:id]).destroy