app/models/article.rb

SELECT "categories".* FROM "categories" INNER JOIN "filters" ON "categories"."id" = "filters"."category_id" WHERE "filters"."article_id" = ?  [["article_id", 8]]
---
  def all_categories
    categories.map(&:category).join(', ')

SELECT "categories".* FROM "categories" INNER JOIN "filters" ON "categories"."id" = "filters"."category_id" WHERE "filters"."article_id" = ?  [["article_id", 8]]
INSERT INTO "categories" ("category") VALUES (?)  [["category", "ttt"]]
SELECT  "categories".* FROM "categories" WHERE "categories"."category" = ? ORDER BY "categories"."id" ASC LIMIT ?  [["category", "ttt"], ["LIMIT", 1]]
---
  def all_categories=(categories)
    self.categories = categories.split(',').map do |category|
      Category.where(category: category.strip).first_or_create