app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "lvo123ua@gmail.com"], ["LIMIT", 1]]
---
  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
    if login == conditions.delete(:login)
      where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value", { :value => login.downcase }]).first
    elsif conditions.has_key?(:username) || conditions.has_key?(:email)
      where(conditions.to_h).first

SELECT  1 AS one FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "fon_luchs"], ["LIMIT", 1]]
---
  def validate_username
    if User.where(email: user_name).exists?