app/views/categories/show.html.erb

SELECT "articles".* FROM "articles" INNER JOIN "filters" ON "articles"."id" = "filters"."article_id" WHERE "filters"."category_id" = ?  [["category_id", 17]]
SELECT  1 AS one FROM "articles" INNER JOIN "filters" ON "articles"."id" = "filters"."article_id" WHERE "filters"."category_id" = ? LIMIT ?  [["category_id", 17], ["LIMIT", 1]]
---

<%   if @category.articles.empty? %>